C:\Users\amand\OneDrive\Documentos

Importando as bibliotecas

In [3]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [16]:
# fazendo a leitura dos dados
orders = pd.read_csv('orders.csv')
#exibindo as 5 primeiras linhas do dataframe
orders.head()

,order_id,store_id,channel_id,payment_order_id,delivery_order_id,order_status,order_amount,order_delivery_fee,order_delivery_cost,order_created_hour,...,order_moment_delivering,order_moment_delivered,order_moment_finished,order_metric_collected_time,order_metric_paused_time,order_metric_production_time,order_metric_walking_time,order_metric_expediton_speed_time,order_metric_transit_time,order_metric_cycle_time
0,68405119,3512,5,68405119,68405119,CANCELED,62.7,0.0,NaN,0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,68405123,3512,5,68405123,68405123,CANCELED,62.7,0.0,NaN,0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,68405206,3512,5,68405206,68405206,CANCELED,115.5,0.0,NaN,0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,68405465,3401,5,68405465,68405465,CANCELED,55.9,0.0,NaN,0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,68406064,3401,5,68406064,68406064,CANCELED,37.9,0.0,NaN,0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [17]:
# fazendo a leitura dos dados
channels = pd.read_csv('channels.csv')
#exibindo as 5 primeiras linhas do dataframe
channels.head()

   channel_id channel_name channel_type
0           1  OTHER PLACE  OWN CHANNEL
1           2  PHONE PLACE  OWN CHANNEL
2           3  WHATS PLACE  OWN CHANNEL
3           4   FACE PLACE  OWN CHANNEL
4           5   FOOD PLACE  MARKETPLACE

In [18]:
# fazendo a leitura dos dados
deliveries = pd.read_csv('deliveries.csv')
#exibindo as 5 primeiras linhas do dataframe
deliveries.head()

,delivery_id,delivery_order_id,driver_id,delivery_distance_meters,delivery_status
0,2174658,68413340,8378.0,5199.0,DELIVERED
1,2174660,68414309,2473.0,410.0,DELIVERED
2,2174661,68416230,7615.0,3784.0,DELIVERED
3,2174663,68412721,8378.0,5714.0,DELIVERED
4,2174675,68414018,10463.0,3746.0,DELIVERED

In [19]:
# fazendo a leitura dos dados
drivers = pd.read_csv('drivers.csv')
#exibindo as 5 primeiras linhas do dataframe
drivers.head()

   driver_id driver_modal        driver_type
0        133      MOTOBOY  LOGISTIC OPERATOR
1        138      MOTOBOY          FREELANCE
2        140      MOTOBOY          FREELANCE
3        143        BIKER          FREELANCE
4        148      MOTOBOY          FREELANCE

In [23]:
# fazendo a leitura dos dados
hubs = pd.read_csv('hubs.csv',encoding='latin1')
#exibindo as 5 primeiras linhas do dataframe
hubs.head()

,hub_id,hub_name,hub_city,hub_state,hub_latitude,hub_longitude
0,2,BLUE SHOPPING,PORTO ALEGRE,RS,-30.047415,-51.213510
1,3,GREEN SHOPPING,PORTO ALEGRE,RS,-30.037415,-51.203520
2,4,RED SHOPPING,PORTO ALEGRE,RS,-30.021948,-51.208382
3,5,FUNK SHOPPING,RIO DE JANEIRO,RJ,-23.000750,-43.318282
4,8,GOLDEN SHOPPING,RIO DE JANEIRO,RJ,-22.921475,-43.234774

In [21]:
# fazendo a leitura dos dados
payments = pd.read_csv('payments.csv')
#exibindo as 5 primeiras linhas do dataframe
payments.head()

,payment_id,payment_order_id,payment_amount,payment_fee,payment_method,payment_status
0,4427917,68410055,118.44,0.00,VOUCHER,PAID
1,4427918,68410055,394.81,7.90,ONLINE,PAID
2,4427941,68412721,206.95,5.59,ONLINE,PAID
3,4427948,68413340,58.80,1.59,ONLINE,PAID
4,4427955,68414018,45.80,0.92,ONLINE,PAID

In [24]:

# fazendo a leitura dos dados
stores = pd.read_csv('stores.csv',encoding='latin1')
#exibindo as 5 primeiras linhas do dataframe
stores.head()

,store_id,hub_id,store_name,store_segment,store_plan_price,store_latitude,store_longitude
0,3,2,CUMIURI,FOOD,0.0,NaN,NaN
1,6,3,PIMGUCIS DA VIVA,FOOD,0.0,-30.037415,-51.203520
2,8,3,RASMUR S,FOOD,0.0,-30.037415,-51.203520
3,53,8,PAPA SUCIS,FOOD,0.0,-22.921475,-43.234822
4,54,8,VUZPI PAZZIS,FOOD,0.0,-22.921475,-43.234822

In [ ]:
# Entendendo a tipagem dos dados da tabela orders
orders.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 368999 entries, 0 to 368998
Data columns (total 29 columns):
 #   Column                             Non-Null Count   Dtype
---  ------                             --------------   -----
 0   order_id                           368999 non-null  int64
 1   store_id                           368999 non-null  int64
 2   channel_id                         368999 non-null  int64
 3   payment_order_id                   368999 non-null  int64
 4   delivery_order_id                  368999 non-null  int64
 5   order_status                       368999 non-null  object
 6   order_amount                       368999 non-null  float64
 7   order_delivery_fee                 368999 non-null  float64
 8   order_delivery_cost                361794 non-null  float64
 9   order_created_hour                 368999 non-null  int64
 10  order_created_minute               368999 non-null  int64
 11  order_created_day                  368999 non-null  int64
 12  order_created_month                368999 non-null  int64
 13  order_created_year                 368999 non-null  int64
 14  order_moment_created               368999 non-null  object
 15  order_moment_accepted              359538 non-null  object
 16  order_moment_ready                 343893 non-null  object
 17  order_moment_collected             326105 non-null  object
 18  order_moment_in_expedition         301570 non-null  object
 19  order_moment_delivering            343683 non-null  object
 20  order_moment_delivered             19601 non-null   object
 21  order_moment_finished              353400 non-null  object
 22  order_metric_collected_time        317507 non-null  float64
 23  order_metric_paused_time           297594 non-null  float64
 24  order_metric_production_time       343892 non-null  float64
 25  order_metric_walking_time          294943 non-null  float64
 26  order_metric_expediton_speed_time  334417 non-null  float64
 27  order_metric_transit_time          343142 non-null  float64
 28  order_metric_cycle_time            353380 non-null  float64
dtypes: float64(10), int64(10), object(9)
memory usage: 81.6+ MB

In [26]:
# Entendendo a tipagem dos dados da tabela channels
channels.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 40 entries, 0 to 39
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   channel_id    40 non-null     int64
 1   channel_name  40 non-null     object
 2   channel_type  40 non-null     object
dtypes: int64(1), object(2)
memory usage: 1.1+ KB

In [27]:
# Entendendo a tipagem dos dados da tabela deliveries
deliveries.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 378843 entries, 0 to 378842
Data columns (total 5 columns):
 #   Column                    Non-Null Count   Dtype
---  ------                    --------------   -----
 0   delivery_id               378843 non-null  int64
 1   delivery_order_id         378843 non-null  int64
 2   driver_id                 362957 non-null  float64
 3   delivery_distance_meters  378770 non-null  float64
 4   delivery_status           378843 non-null  object
dtypes: float64(2), int64(2), object(1)
memory usage: 14.5+ MB

In [28]:
# Entendendo a tipagem dos dados da tabela drivers
drivers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4824 entries, 0 to 4823
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   driver_id     4824 non-null   int64
 1   driver_modal  4824 non-null   object
 2   driver_type   4824 non-null   object
dtypes: int64(1), object(2)
memory usage: 113.2+ KB

In [29]:
# Entendendo a tipagem dos dados da tabela hubs
hubs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32 entries, 0 to 31
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   hub_id         32 non-null     int64
 1   hub_name       32 non-null     object
 2   hub_city       32 non-null     object
 3   hub_state      32 non-null     object
 4   hub_latitude   32 non-null     float64
 5   hub_longitude  32 non-null     float64
dtypes: float64(2), int64(1), object(3)
memory usage: 1.6+ KB

In [30]:
# Entendendo a tipagem dos dados da tabela payments
payments.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 400834 entries, 0 to 400833
Data columns (total 6 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   payment_id        400834 non-null  int64
 1   payment_order_id  400834 non-null  int64
 2   payment_amount    400834 non-null  float64
 3   payment_fee       400659 non-null  float64
 4   payment_method    400834 non-null  object
 5   payment_status    400834 non-null  object
dtypes: float64(2), int64(2), object(2)
memory usage: 18.3+ MB

In [31]:
# Entendendo a tipagem dos dados da tabela stores
stores.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 951 entries, 0 to 950
Data columns (total 7 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   store_id          951 non-null    int64
 1   hub_id            951 non-null    int64
 2   store_name        951 non-null    object
 3   store_segment     951 non-null    object
 4   store_plan_price  836 non-null    float64
 5   store_latitude    935 non-null    float64
 6   store_longitude   935 non-null    float64
dtypes: float64(3), int64(2), object(2)
memory usage: 52.1+ KB

Processo de tratamento dos dados

In [32]:
#Verificando a existência de valores nulos nas tabelas
orders.isnull().sum()

order_id                                  0
store_id                                  0
channel_id                                0
payment_order_id                          0
delivery_order_id                         0
order_status                              0
order_amount                              0
order_delivery_fee                        0
order_delivery_cost                    7205
order_created_hour                        0
order_created_minute                      0
order_created_day                         0
order_created_month                       0
order_created_year                        0
order_moment_created                      0
order_moment_accepted                  9461
order_moment_ready                    25106
order_moment_collected                42894
order_moment_in_expedition            67429
order_moment_delivering               25316
order_moment_delivered               349398
order_moment_finished                 15599
order_metric_collected_time           51492
order_metric_paused_time              71405
order_metric_production_time          25107
order_metric_walking_time             74056
order_metric_expediton_speed_time     34582
order_metric_transit_time             25857
order_metric_cycle_time               15619
dtype: int64

In [33]:
#Verificando a existência de valores nulos nas tabelas
channels.isnull().sum()

channel_id      0
channel_name    0
channel_type    0
dtype: int64

In [34]:
#Verificando a existência de valores nulos nas tabelas
deliveries.isnull().sum()

delivery_id                     0
delivery_order_id               0
driver_id                   15886
delivery_distance_meters       73
delivery_status                 0
dtype: int64

In [35]:
#Verificando a existência de valores nulos nas tabelas
drivers.isnull().sum()

driver_id       0
driver_modal    0
driver_type     0
dtype: int64

In [36]:
 #Verificando a existência de valores nulos nas tabelas
hubs.isnull().sum()

hub_id           0
hub_name         0
hub_city         0
hub_state        0
hub_latitude     0
hub_longitude    0
dtype: int64

In [37]:
#Verificando a existência de valores nulos nas tabelas
payments.isnull().sum()

payment_id            0
payment_order_id      0
payment_amount        0
payment_fee         175
payment_method        0
payment_status        0
dtype: int64

In [38]:
#Verificando a existência de valores nulos nas tabelas
stores.isnull().sum()

store_id              0
hub_id                0
store_name            0
store_segment         0
store_plan_price    115
store_latitude       16
store_longitude      16
dtype: int64